dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/src/pin_packages/cy_hal_psoc6_01_124_bga.c
/* Connections for: bless_ext_pa_tx_ctl_out */
const cy_resource_pin_mapping_t cy_pin_map_bless_ext_pa_tx_ctl_out[1] = {
    {P7_5, &CY_BLESS_0, CY_PIN_OUT_FUNCTION(P7_5_BLESS_EXT_PA_TX_CTL_OUT)},
};

/* Connections for: bless_mxd_act_bpktctl */
const cy_resource_pin_mapping_t cy_pin_map_bless_mxd_act_bpktctl[1] = {
    {P3_3, &CY_BLESS_0, CY_PIN_OUT_FUNCTION(P3_3_BLESS_MXD_ACT_BPKTCTL)},
};

/* Connections for: bless_mxd_act_dbus_rx_en */
const cy_resource_pin_mapping_t cy_pin_map_bless_mxd_act_dbus_rx_en[1] = {
    {P3_1, &CY_BLESS_0, CY_PIN_OUT_FUNCTION(P3_1_BLESS_MXD_ACT_DBUS_RX_EN)},
};

/* Connections for: bless_mxd_act_dbus_tx_en */
const cy_resource_pin_mapping_t cy_pin_map_bless_mxd_act_dbus_tx_en[1] = {
    {P3_2, &CY_BLESS_0, CY_PIN_OUT_FUNCTION(P3_2_BLESS_MXD_ACT_DBUS_TX_EN)},
};

/* Connections for: bless_mxd_act_txd_rxd */
const cy_resource_pin_mapping_t cy_pin_map_bless_mxd_act_txd_rxd[1] = {
    {P3_4, &CY_BLESS_0, CY_PIN_OUT_FUNCTION(P3_4_BLESS_MXD_ACT_TXD_RXD)},
};

/* Connections for: bless_mxd_dpslp_act_ldo_en */
const cy_resource_pin_mapping_t cy_pin_map_bless_mxd_dpslp_act_ldo_en[1] = {
    {P2_6, &CY_BLESS_0, CY_PIN_OUT_FUNCTION(P2_6_BLESS_MXD_DPSLP_ACT_LDO_EN)},
};

/* Connections for: bless_mxd_dpslp_buck_en */
const cy_resource_pin_mapping_t cy_pin_map_bless_mxd_dpslp_buck_en[1] = {
    {P2_2, &CY_BLESS_0, CY_PIN_OUT_FUNCTION(P2_2_BLESS_MXD_DPSLP_BUCK_EN)},
};

/* Connections for: bless_mxd_dpslp_clk_en */
const cy_resource_pin_mapping_t cy_pin_map_bless_mxd_dpslp_clk_en[1] = {
    {P2_4, &CY_BLESS_0, CY_PIN_OUT_FUNCTION(P2_4_BLESS_MXD_DPSLP_CLK_EN)},
};

/* Connections for: bless_mxd_dpslp_dig_ldo_en */
const cy_resource_pin_mapping_t cy_pin_map_bless_mxd_dpslp_dig_ldo_en[1] = {
    {P3_0, &CY_BLESS_0, CY_PIN_OUT_FUNCTION(P3_0_BLESS_MXD_DPSLP_DIG_LDO_EN)},
};

/* Connections for: bless_mxd_dpslp_isolate_n */
const cy_resource_pin_mapping_t cy_pin_map_bless_mxd_dpslp_isolate_n[1] = {
    {P2_5, &CY_BLESS_0, CY_PIN_OUT_FUNCTION(P2_5_BLESS_MXD_DPSLP_ISOLATE_N)},
};

/* Connections for: bless_mxd_dpslp_rcb_clk */
const cy_resource_pin_mapping_t cy_pin_map_bless_mxd_dpslp_rcb_clk[1] = {
    {P4_0, &CY_BLESS_0, CY_PIN_OUT_FUNCTION(P4_0_BLESS_MXD_DPSLP_RCB_CLK)},
};

/* Connections for: bless_mxd_dpslp_rcb_data */
const cy_resource_pin_mapping_t cy_pin_map_bless_mxd_dpslp_rcb_data[1] = {
    {P3_5, &CY_BLESS_0, CY_PIN_OUT_FUNCTION(P3_5_BLESS_MXD_DPSLP_RCB_DATA)},
};

/* Connections for: bless_mxd_dpslp_rcb_le */
const cy_resource_pin_mapping_t cy_pin_map_bless_mxd_dpslp_rcb_le[1] = {
    {P4_1, &CY_BLESS_0, CY_PIN_OUT_FUNCTION(P4_1_BLESS_MXD_DPSLP_RCB_LE)},
};

/* Connections for: bless_mxd_dpslp_reset_n */
const cy_resource_pin_mapping_t cy_pin_map_bless_mxd_dpslp_reset_n[1] = {
    {P2_3, &CY_BLESS_0, CY_PIN_OUT_FUNCTION(P2_3_BLESS_MXD_DPSLP_RESET_N)},
};

/* Connections for: bless_mxd_dpslp_ret_ldo_ol_hv */
const cy_resource_pin_mapping_t cy_pin_map_bless_mxd_dpslp_ret_ldo_ol_hv[1] = {
    {P2_1, &CY_BLESS_0, CY_PIN_OUT_FUNCTION(P2_1_BLESS_MXD_DPSLP_RET_LDO_OL_HV)},
};

/* Connections for: bless_mxd_dpslp_ret_switch_hv */
const cy_resource_pin_mapping_t cy_pin_map_bless_mxd_dpslp_ret_switch_hv[1] = {
    {P2_0, &CY_BLESS_0, CY_PIN_OUT_FUNCTION(P2_0_BLESS_MXD_DPSLP_RET_SWITCH_HV)},
};

/* Connections for: bless_mxd_dpslp_xtal_en */
const cy_resource_pin_mapping_t cy_pin_map_bless_mxd_dpslp_xtal_en[1] = {
    {P2_7, &CY_BLESS_0, CY_PIN_OUT_FUNCTION(P2_7_BLESS_MXD_DPSLP_XTAL_EN)},
};

/* Connections for: lpcomp_dsi_comp0 */
const cy_resource_pin_mapping_t cy_pin_map_lpcomp_dsi_comp0[1] = {
    {P8_2, &CY_LPCOMP_0_0, CY_PIN_OUT_FUNCTION(P8_2_LPCOMP_DSI_COMP0)},
};

/* Connections for: lpcomp_dsi_comp1 */
const cy_resource_pin_mapping_t cy_pin_map_lpcomp_dsi_comp1[1] = {
    {P8_3, &CY_LPCOMP_0_0, CY_PIN_OUT_FUNCTION(P8_3_LPCOMP_DSI_COMP1)},
};

/* Connections for: pass_dsi_ctb_cmp0 */
const cy_resource_pin_mapping_t cy_pin_map_pass_dsi_ctb_cmp0[1] = {
    {P9_2, &CY_OPAMP_0, CY_PIN_OUT_FUNCTION(P9_2_PASS_DSI_CTB_CMP0)},
};

/* Connections for: pass_dsi_ctb_cmp1 */
const cy_resource_pin_mapping_t cy_pin_map_pass_dsi_ctb_cmp1[1] = {
    {P9_3, &CY_OPAMP_0, CY_PIN_OUT_FUNCTION(P9_3_PASS_DSI_CTB_CMP1)},
};

/* Connections for: scb_i2c_scl */
const cy_resource_pin_mapping_t cy_pin_map_scb_i2c_scl[17] = {
    {P0_2, &CY_SCB_0, CY_PIN_OD_FUNCTION(P0_2_SCB0_I2C_SCL)},
    {P1_0, &CY_SCB_7, CY_PIN_OD_FUNCTION(P1_0_SCB7_I2C_SCL)},
    {P2_0, &CY_SCB_1, CY_PIN_OD_FUNCTION(P2_0_SCB1_I2C_SCL)},
    {P3_0, &CY_SCB_2, CY_PIN_OD_FUNCTION(P3_0_SCB2_I2C_SCL)},
    {P4_0, &CY_SCB_7, CY_PIN_OD_FUNCTION(P4_0_SCB7_I2C_SCL)},
    {P5_0, &CY_SCB_5, CY_PIN_OD_FUNCTION(P5_0_SCB5_I2C_SCL)},
    {P6_0, &CY_SCB_3, CY_PIN_OD_FUNCTION(P6_0_SCB3_I2C_SCL)},
    {P6_0, &CY_SCB_8, CY_PIN_OD_FUNCTION(P6_0_SCB8_I2C_SCL)},
    {P6_4, &CY_SCB_6, CY_PIN_OD_FUNCTION(P6_4_SCB6_I2C_SCL)},
    {P6_4, &CY_SCB_8, CY_PIN_OD_FUNCTION(P6_4_SCB8_I2C_SCL)},
    {P7_0, &CY_SCB_4, CY_PIN_OD_FUNCTION(P7_0_SCB4_I2C_SCL)},
    {P8_0, &CY_SCB_4, CY_PIN_OD_FUNCTION(P8_0_SCB4_I2C_SCL)},
    {P9_0, &CY_SCB_2, CY_PIN_OD_FUNCTION(P9_0_SCB2_I2C_SCL)},
    {P10_0, &CY_SCB_1, CY_PIN_OD_FUNCTION(P10_0_SCB1_I2C_SCL)},
    {P11_0, &CY_SCB_5, CY_PIN_OD_FUNCTION(P11_0_SCB5_I2C_SCL)},
    {P12_0, &CY_SCB_6, CY_PIN_OD_FUNCTION(P12_0_SCB6_I2C_SCL)},
    {P13_0, &CY_SCB_6, CY_PIN_OD_FUNCTION(P13_0_SCB6_I2C_SCL)},
};

/* Connections for: scb_i2c_sda */
const cy_resource_pin_mapping_t cy_pin_map_scb_i2c_sda[17] = {
    {P0_3, &CY_SCB_0, CY_PIN_OD_FUNCTION(P0_3_SCB0_I2C_SDA)},
    {P1_1, &CY_SCB_7, CY_PIN_OD_FUNCTION(P1_1_SCB7_I2C_SDA)},
    {P2_1, &CY_SCB_1, CY_PIN_OD_FUNCTION(P2_1_SCB1_I2C_SDA)},
    {P3_1, &CY_SCB_2, CY_PIN_OD_FUNCTION(P3_1_SCB2_I2C_SDA)},
    {P4_1, &CY_SCB_7, CY_PIN_OD_FUNCTION(P4_1_SCB7_I2C_SDA)},
    {P5_1, &CY_SCB_5, CY_PIN_OD_FUNCTION(P5_1_SCB5_I2C_SDA)},
    {P6_1, &CY_SCB_3, CY_PIN_OD_FUNCTION(P6_1_SCB3_I2C_SDA)},
    {P6_1, &CY_SCB_8, CY_PIN_OD_FUNCTION(P6_1_SCB8_I2C_SDA)},
    {P6_5, &CY_SCB_6, CY_PIN_OD_FUNCTION(P6_5_SCB6_I2C_SDA)},
    {P6_5, &CY_SCB_8, CY_PIN_OD_FUNCTION(P6_5_SCB8_I2C_SDA)},
    {P7_1, &CY_SCB_4, CY_PIN_OD_FUNCTION(P7_1_SCB4_I2C_SDA)},
    {P8_1, &CY_SCB_4, CY_PIN_OD_FUNCTION(P8_1_SCB4_I2C_SDA)},
    {P9_1, &CY_SCB_2, CY_PIN_OD_FUNCTION(P9_1_SCB2_I2C_SDA)},
    {P10_1, &CY_SCB_1, CY_PIN_OD_FUNCTION(P10_1_SCB1_I2C_SDA)},
    {P11_1, &CY_SCB_5, CY_PIN_OD_FUNCTION(P11_1_SCB5_I2C_SDA)},
    {P12_1, &CY_SCB_6, CY_PIN_OD_FUNCTION(P12_1_SCB6_I2C_SDA)},
    {P13_1, &CY_SCB_6, CY_PIN_OD_FUNCTION(P13_1_SCB6_I2C_SDA)},
};

/* Connections for: scb_spi_clk */
const cy_resource_pin_mapping_t cy_pin_map_scb_spi_clk[16] = {
    {P0_4, &CY_SCB_0, CY_PIN_OUT_FUNCTION(P0_4_SCB0_SPI_CLK)},
    {P1_2, &CY_SCB_7, CY_PIN_OUT_FUNCTION(P1_2_SCB7_SPI_CLK)},
    {P2_2, &CY_SCB_1, CY_PIN_OUT_FUNCTION(P2_2_SCB1_SPI_CLK)},
    {P3_2, &CY_SCB_2, CY_PIN_OUT_FUNCTION(P3_2_SCB2_SPI_CLK)},
    {P5_2, &CY_SCB_5, CY_PIN_OUT_FUNCTION(P5_2_SCB5_SPI_CLK)},
    {P6_2, &CY_SCB_3, CY_PIN_OUT_FUNCTION(P6_2_SCB3_SPI_CLK)},
    {P6_2, &CY_SCB_8, CY_PIN_OUT_FUNCTION(P6_2_SCB8_SPI_CLK)},
    {P6_6, &CY_SCB_6, CY_PIN_OUT_FUNCTION(P6_6_SCB6_SPI_CLK)},
    {P6_6, &CY_SCB_8, CY_PIN_OUT_FUNCTION(P6_6_SCB8_SPI_CLK)},
    {P7_2, &CY_SCB_4, CY_PIN_OUT_FUNCTION(P7_2_SCB4_SPI_CLK)},
    {P8_2, &CY_SCB_4, CY_PIN_OUT_FUNCTION(P8_2_SCB4_SPI_CLK)},
    {P9_2, &CY_SCB_2, CY_PIN_OUT_FUNCTION(P9_2_SCB2_SPI_CLK)},
    {P10_2, &CY_SCB_1, CY_PIN_OUT_FUNCTION(P10_2_SCB1_SPI_CLK)},
    {P11_2, &CY_SCB_5, CY_PIN_OUT_FUNCTION(P11_2_SCB5_SPI_CLK)},
    {P12_2, &CY_SCB_6, CY_PIN_OUT_FUNCTION(P12_2_SCB6_SPI_CLK)},
    {P13_2, &CY_SCB_6, CY_PIN_OUT_FUNCTION(P13_2_SCB6_SPI_CLK)},
};

/* Connections for: scb_spi_miso */
const cy_resource_pin_mapping_t cy_pin_map_scb_spi_miso[17] = {
    {P0_3, &CY_SCB_0, CY_PIN_IN_FUNCTION(P0_3_SCB0_SPI_MISO)},
    {P1_1, &CY_SCB_7, CY_PIN_IN_FUNCTION(P1_1_SCB7_SPI_MISO)},
    {P2_1, &CY_SCB_1, CY_PIN_IN_FUNCTION(P2_1_SCB1_SPI_MISO)},
    {P3_1, &CY_SCB_2, CY_PIN_IN_FUNCTION(P3_1_SCB2_SPI_MISO)},
    {P4_1, &CY_SCB_7, CY_PIN_IN_FUNCTION(P4_1_SCB7_SPI_MISO)},
    {P5_1, &CY_SCB_5, CY_PIN_IN_FUNCTION(P5_1_SCB5_SPI_MISO)},
    {P6_1, &CY_SCB_3, CY_PIN_IN_FUNCTION(P6_1_SCB3_SPI_MISO)},
    {P6_1, &CY_SCB_8, CY_PIN_IN_FUNCTION(P6_1_SCB8_SPI_MISO)},
    {P6_5, &CY_SCB_6, CY_PIN_IN_FUNCTION(P6_5_SCB6_SPI_MISO)},
    {P6_5, &CY_SCB_8, CY_PIN_IN_FUNCTION(P6_5_SCB8_SPI_MISO)},
    {P7_1, &CY_SCB_4, CY_PIN_IN_FUNCTION(P7_1_SCB4_SPI_MISO)},
    {P8_1, &CY_SCB_4, CY_PIN_IN_FUNCTION(P8_1_SCB4_SPI_MISO)},
    {P9_1, &CY_SCB_2, CY_PIN_IN_FUNCTION(P9_1_SCB2_SPI_MISO)},
    {P10_1, &CY_SCB_1, CY_PIN_IN_FUNCTION(P10_1_SCB1_SPI_MISO)},
    {P11_1, &CY_SCB_5, CY_PIN_IN_FUNCTION(P11_1_SCB5_SPI_MISO)},
    {P12_1, &CY_SCB_6, CY_PIN_IN_FUNCTION(P12_1_SCB6_SPI_MISO)},
    {P13_1, &CY_SCB_6, CY_PIN_IN_FUNCTION(P13_1_SCB6_SPI_MISO)},
};

