dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/src/pin_packages/cy_hal_psoc6_01_124_bga.c
/* Connections for: scb_spi_mosi */
const cy_resource_pin_mapping_t cy_pin_map_scb_spi_mosi[17] = {
    {P0_2, &CY_SCB_0, CY_PIN_OUT_FUNCTION(P0_2_SCB0_SPI_MOSI)},
    {P1_0, &CY_SCB_7, CY_PIN_OUT_FUNCTION(P1_0_SCB7_SPI_MOSI)},
    {P2_0, &CY_SCB_1, CY_PIN_OUT_FUNCTION(P2_0_SCB1_SPI_MOSI)},
    {P3_0, &CY_SCB_2, CY_PIN_OUT_FUNCTION(P3_0_SCB2_SPI_MOSI)},
    {P4_0, &CY_SCB_7, CY_PIN_OUT_FUNCTION(P4_0_SCB7_SPI_MOSI)},
    {P5_0, &CY_SCB_5, CY_PIN_OUT_FUNCTION(P5_0_SCB5_SPI_MOSI)},
    {P6_0, &CY_SCB_3, CY_PIN_OUT_FUNCTION(P6_0_SCB3_SPI_MOSI)},
    {P6_0, &CY_SCB_8, CY_PIN_OUT_FUNCTION(P6_0_SCB8_SPI_MOSI)},
    {P6_4, &CY_SCB_6, CY_PIN_OUT_FUNCTION(P6_4_SCB6_SPI_MOSI)},
    {P6_4, &CY_SCB_8, CY_PIN_OUT_FUNCTION(P6_4_SCB8_SPI_MOSI)},
    {P7_0, &CY_SCB_4, CY_PIN_OUT_FUNCTION(P7_0_SCB4_SPI_MOSI)},
    {P8_0, &CY_SCB_4, CY_PIN_OUT_FUNCTION(P8_0_SCB4_SPI_MOSI)},
    {P9_0, &CY_SCB_2, CY_PIN_OUT_FUNCTION(P9_0_SCB2_SPI_MOSI)},
    {P10_0, &CY_SCB_1, CY_PIN_OUT_FUNCTION(P10_0_SCB1_SPI_MOSI)},
    {P11_0, &CY_SCB_5, CY_PIN_OUT_FUNCTION(P11_0_SCB5_SPI_MOSI)},
    {P12_0, &CY_SCB_6, CY_PIN_OUT_FUNCTION(P12_0_SCB6_SPI_MOSI)},
    {P13_0, &CY_SCB_6, CY_PIN_OUT_FUNCTION(P13_0_SCB6_SPI_MOSI)},
};

/* Connections for: scb_spi_select0 */
const cy_resource_pin_mapping_t cy_pin_map_scb_spi_select0[16] = {
    {P0_5, &CY_SCB_0, CY_PIN_OUT_FUNCTION(P0_5_SCB0_SPI_SELECT0)},
    {P1_3, &CY_SCB_7, CY_PIN_OUT_FUNCTION(P1_3_SCB7_SPI_SELECT0)},
    {P2_3, &CY_SCB_1, CY_PIN_OUT_FUNCTION(P2_3_SCB1_SPI_SELECT0)},
    {P3_3, &CY_SCB_2, CY_PIN_OUT_FUNCTION(P3_3_SCB2_SPI_SELECT0)},
    {P5_3, &CY_SCB_5, CY_PIN_OUT_FUNCTION(P5_3_SCB5_SPI_SELECT0)},
    {P6_3, &CY_SCB_3, CY_PIN_OUT_FUNCTION(P6_3_SCB3_SPI_SELECT0)},
    {P6_3, &CY_SCB_8, CY_PIN_OUT_FUNCTION(P6_3_SCB8_SPI_SELECT0)},
    {P6_7, &CY_SCB_6, CY_PIN_OUT_FUNCTION(P6_7_SCB6_SPI_SELECT0)},
    {P6_7, &CY_SCB_8, CY_PIN_OUT_FUNCTION(P6_7_SCB8_SPI_SELECT0)},
    {P7_3, &CY_SCB_4, CY_PIN_OUT_FUNCTION(P7_3_SCB4_SPI_SELECT0)},
    {P8_3, &CY_SCB_4, CY_PIN_OUT_FUNCTION(P8_3_SCB4_SPI_SELECT0)},
    {P9_3, &CY_SCB_2, CY_PIN_OUT_FUNCTION(P9_3_SCB2_SPI_SELECT0)},
    {P10_3, &CY_SCB_1, CY_PIN_OUT_FUNCTION(P10_3_SCB1_SPI_SELECT0)},
    {P11_3, &CY_SCB_5, CY_PIN_OUT_FUNCTION(P11_3_SCB5_SPI_SELECT0)},
    {P12_3, &CY_SCB_6, CY_PIN_OUT_FUNCTION(P12_3_SCB6_SPI_SELECT0)},
    {P13_3, &CY_SCB_6, CY_PIN_OUT_FUNCTION(P13_3_SCB6_SPI_SELECT0)},
};

/* Connections for: scb_spi_select1 */
const cy_resource_pin_mapping_t cy_pin_map_scb_spi_select1[13] = {
    {P0_0, &CY_SCB_0, CY_PIN_OUT_FUNCTION(P0_0_SCB0_SPI_SELECT1)},
    {P1_4, &CY_SCB_7, CY_PIN_OUT_FUNCTION(P1_4_SCB7_SPI_SELECT1)},
    {P2_4, &CY_SCB_1, CY_PIN_OUT_FUNCTION(P2_4_SCB1_SPI_SELECT1)},
    {P3_4, &CY_SCB_2, CY_PIN_OUT_FUNCTION(P3_4_SCB2_SPI_SELECT1)},
    {P5_4, &CY_SCB_5, CY_PIN_OUT_FUNCTION(P5_4_SCB5_SPI_SELECT1)},
    {P7_4, &CY_SCB_4, CY_PIN_OUT_FUNCTION(P7_4_SCB4_SPI_SELECT1)},
    {P7_7, &CY_SCB_3, CY_PIN_OUT_FUNCTION(P7_7_SCB3_SPI_SELECT1)},
    {P8_4, &CY_SCB_4, CY_PIN_OUT_FUNCTION(P8_4_SCB4_SPI_SELECT1)},
    {P9_4, &CY_SCB_2, CY_PIN_OUT_FUNCTION(P9_4_SCB2_SPI_SELECT1)},
    {P10_4, &CY_SCB_1, CY_PIN_OUT_FUNCTION(P10_4_SCB1_SPI_SELECT1)},
    {P11_4, &CY_SCB_5, CY_PIN_OUT_FUNCTION(P11_4_SCB5_SPI_SELECT1)},
    {P12_4, &CY_SCB_6, CY_PIN_OUT_FUNCTION(P12_4_SCB6_SPI_SELECT1)},
    {P13_4, &CY_SCB_6, CY_PIN_OUT_FUNCTION(P13_4_SCB6_SPI_SELECT1)},
};

/* Connections for: scb_spi_select2 */
const cy_resource_pin_mapping_t cy_pin_map_scb_spi_select2[13] = {
    {P0_1, &CY_SCB_0, CY_PIN_OUT_FUNCTION(P0_1_SCB0_SPI_SELECT2)},
    {P1_5, &CY_SCB_7, CY_PIN_OUT_FUNCTION(P1_5_SCB7_SPI_SELECT2)},
    {P2_5, &CY_SCB_1, CY_PIN_OUT_FUNCTION(P2_5_SCB1_SPI_SELECT2)},
    {P3_5, &CY_SCB_2, CY_PIN_OUT_FUNCTION(P3_5_SCB2_SPI_SELECT2)},
    {P5_5, &CY_SCB_5, CY_PIN_OUT_FUNCTION(P5_5_SCB5_SPI_SELECT2)},
    {P7_5, &CY_SCB_4, CY_PIN_OUT_FUNCTION(P7_5_SCB4_SPI_SELECT2)},
    {P8_5, &CY_SCB_4, CY_PIN_OUT_FUNCTION(P8_5_SCB4_SPI_SELECT2)},
    {P8_7, &CY_SCB_3, CY_PIN_OUT_FUNCTION(P8_7_SCB3_SPI_SELECT2)},
    {P9_5, &CY_SCB_2, CY_PIN_OUT_FUNCTION(P9_5_SCB2_SPI_SELECT2)},
    {P10_5, &CY_SCB_1, CY_PIN_OUT_FUNCTION(P10_5_SCB1_SPI_SELECT2)},
    {P11_5, &CY_SCB_5, CY_PIN_OUT_FUNCTION(P11_5_SCB5_SPI_SELECT2)},
    {P12_5, &CY_SCB_6, CY_PIN_OUT_FUNCTION(P12_5_SCB6_SPI_SELECT2)},
    {P13_5, &CY_SCB_6, CY_PIN_OUT_FUNCTION(P13_5_SCB6_SPI_SELECT2)},
};

/* Connections for: scb_spi_select3 */
const cy_resource_pin_mapping_t cy_pin_map_scb_spi_select3[10] = {
    {P2_6, &CY_SCB_1, CY_PIN_OUT_FUNCTION(P2_6_SCB1_SPI_SELECT3)},
    {P5_6, &CY_SCB_5, CY_PIN_OUT_FUNCTION(P5_6_SCB5_SPI_SELECT3)},
    {P5_7, &CY_SCB_3, CY_PIN_OUT_FUNCTION(P5_7_SCB3_SPI_SELECT3)},
    {P7_6, &CY_SCB_4, CY_PIN_OUT_FUNCTION(P7_6_SCB4_SPI_SELECT3)},
    {P8_6, &CY_SCB_4, CY_PIN_OUT_FUNCTION(P8_6_SCB4_SPI_SELECT3)},
    {P9_6, &CY_SCB_2, CY_PIN_OUT_FUNCTION(P9_6_SCB2_SPI_SELECT3)},
    {P10_6, &CY_SCB_1, CY_PIN_OUT_FUNCTION(P10_6_SCB1_SPI_SELECT3)},
    {P11_6, &CY_SCB_5, CY_PIN_OUT_FUNCTION(P11_6_SCB5_SPI_SELECT3)},
    {P12_6, &CY_SCB_6, CY_PIN_OUT_FUNCTION(P12_6_SCB6_SPI_SELECT3)},
    {P13_6, &CY_SCB_6, CY_PIN_OUT_FUNCTION(P13_6_SCB6_SPI_SELECT3)},
};

/* Connections for: scb_uart_cts */
const cy_resource_pin_mapping_t cy_pin_map_scb_uart_cts[14] = {
    {P0_5, &CY_SCB_0, CY_PIN_IN_FUNCTION(P0_5_SCB0_UART_CTS)},
    {P1_3, &CY_SCB_7, CY_PIN_IN_FUNCTION(P1_3_SCB7_UART_CTS)},
    {P2_3, &CY_SCB_1, CY_PIN_IN_FUNCTION(P2_3_SCB1_UART_CTS)},
    {P3_3, &CY_SCB_2, CY_PIN_IN_FUNCTION(P3_3_SCB2_UART_CTS)},
    {P5_3, &CY_SCB_5, CY_PIN_IN_FUNCTION(P5_3_SCB5_UART_CTS)},
    {P6_3, &CY_SCB_3, CY_PIN_IN_FUNCTION(P6_3_SCB3_UART_CTS)},
    {P6_7, &CY_SCB_6, CY_PIN_IN_FUNCTION(P6_7_SCB6_UART_CTS)},
    {P7_3, &CY_SCB_4, CY_PIN_IN_FUNCTION(P7_3_SCB4_UART_CTS)},
    {P8_3, &CY_SCB_4, CY_PIN_IN_FUNCTION(P8_3_SCB4_UART_CTS)},
    {P9_3, &CY_SCB_2, CY_PIN_IN_FUNCTION(P9_3_SCB2_UART_CTS)},
    {P10_3, &CY_SCB_1, CY_PIN_IN_FUNCTION(P10_3_SCB1_UART_CTS)},
    {P11_3, &CY_SCB_5, CY_PIN_IN_FUNCTION(P11_3_SCB5_UART_CTS)},
    {P12_3, &CY_SCB_6, CY_PIN_IN_FUNCTION(P12_3_SCB6_UART_CTS)},
    {P13_3, &CY_SCB_6, CY_PIN_IN_FUNCTION(P13_3_SCB6_UART_CTS)},
};

